#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
aws_eip.nat[1]: Refreshing state... [id=eipalloc-0bcc2ef224577482c]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-04747dd33b9185bd3]
aws_eip.nat[2]: Refreshing state... [id=eipalloc-0f01b4edbe81acf5e]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f71590ffce04a6d]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08368933c60282243]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c7d69b1ce54dc090]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bfc9cd2d88757e09]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0823136d4d8684e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-03fe445f3a09caf91]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03f3403075db47172]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06c4b56d1b75b8310]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0c9c6a3cb3c951e27]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04da9a7dd058adaee]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d938e60a6926f078]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0798cc1295be44403]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-050dd4e0563086065]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-02ba936bec9acf961]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c387144d0f7b1c3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d2317fba1947cecf]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-051b374aadd21d716]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01ece64fc0c3a6803]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d938e60a6926f0781080289494]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-05d7e52f98c0ba97c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-07a66f37399c233d8]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0afbccd0ee4ac3c2e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00570a92f66c9a896]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b9c035c555394d06]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0840606a4481f31ff]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04da9a7dd058adaee1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0c9c6a3cb3c951e271080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06c4b56d1b75b83101080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-08368933c60282243"
      ~ tags                   = {
          ~ "Name" = "my-vpc-default" -> "vpc-us-east-1-prod-default"
        }
      ~ tags_all               = {
          ~ "Name" = "my-vpc-default" -> "vpc-us-east-1-prod-default"
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0c7d69b1ce54dc090"
      ~ tags                   = {
          ~ "Name" = "my-vpc-default" -> "vpc-us-east-1-prod-default"
        }
      ~ tags_all               = {
          ~ "Name" = "my-vpc-default" -> "vpc-us-east-1-prod-default"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0d0823136d4d8684e"
        name                   = "default"
      ~ tags                   = {
          ~ "Name" = "my-vpc-default" -> "vpc-us-east-1-prod-default"
        }
      ~ tags_all               = {
          ~ "Name" = "my-vpc-default" -> "vpc-us-east-1-prod-default"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-04c387144d0f7b1c3"
      ~ tags     = {
          ~ "Name" = "my-vpc" -> "vpc-us-east-1-prod"
        }
      ~ tags_all = {
          ~ "Name" = "my-vpc" -> "vpc-us-east-1-prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id       = "eipassoc-0b7aa30d54d034bde" -> (known after apply)
      ~ id                   = "nat-0afbccd0ee4ac3c2e" -> (known after apply)
      ~ network_interface_id = "eni-0059fb6d17d7f627c" -> (known after apply)
      ~ private_ip           = "10.0.101.68" -> (known after apply)
      ~ public_ip            = "54.210.101.15" -> (known after apply)
      ~ subnet_id            = "subnet-03f3403075db47172" # forces replacement -> (known after apply) # forces replacement
      ~ tags                 = {
          ~ "Name" = "my-vpc-us-east-1a" -> "vpc-us-east-1-prod-us-east-1a"
        }
      ~ tags_all             = {
          ~ "Name" = "my-vpc-us-east-1a" -> "vpc-us-east-1-prod-us-east-1a"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id       = "eipassoc-0333c53ff8d7fac59" -> (known after apply)
      ~ id                   = "nat-07a66f37399c233d8" -> (known after apply)
      ~ network_interface_id = "eni-08344af2c9fbc5cdb" -> (known after apply)
      ~ private_ip           = "10.0.102.91" -> (known after apply)
      ~ public_ip            = "18.210.198.193" -> (known after apply)
      ~ subnet_id            = "subnet-0bfc9cd2d88757e09" # forces replacement -> (known after apply) # forces replacement
      ~ tags                 = {
          ~ "Name" = "my-vpc-us-east-1b" -> "vpc-us-east-1-prod-us-east-1b"
        }
      ~ tags_all             = {
          ~ "Name" = "my-vpc-us-east-1b" -> "vpc-us-east-1-prod-us-east-1b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[2] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id       = "eipassoc-084dcca5d65bdfbd2" -> (known after apply)
      ~ id                   = "nat-05d7e52f98c0ba97c" -> (known after apply)
      ~ network_interface_id = "eni-088638841589adfa7" -> (known after apply)
      ~ private_ip           = "10.0.103.15" -> (known after apply)
      ~ public_ip            = "44.214.186.176" -> (known after apply)
      ~ subnet_id            = "subnet-03fe445f3a09caf91" # forces replacement -> (known after apply) # forces replacement
      ~ tags                 = {
          ~ "Name" = "my-vpc-us-east-1c" -> "vpc-us-east-1-prod-us-east-1c"
        }
      ~ tags_all             = {
          ~ "Name" = "my-vpc-us-east-1c" -> "vpc-us-east-1-prod-us-east-1c"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-06c4b56d1b75b83101080289494"
      ~ nat_gateway_id         = "nat-0afbccd0ee4ac3c2e" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-04da9a7dd058adaee1080289494"
      ~ nat_gateway_id         = "nat-07a66f37399c233d8" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0c9c6a3cb3c951e271080289494"
      ~ nat_gateway_id         = "nat-05d7e52f98c0ba97c" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06c4b56d1b75b8310"
      ~ tags             = {
          ~ "Name" = "my-vpc-private-us-east-1a" -> "vpc-us-east-1-prod-private-us-east-1a"
        }
      ~ tags_all         = {
          ~ "Name" = "my-vpc-private-us-east-1a" -> "vpc-us-east-1-prod-private-us-east-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-04da9a7dd058adaee"
      ~ tags             = {
          ~ "Name" = "my-vpc-private-us-east-1b" -> "vpc-us-east-1-prod-private-us-east-1b"
        }
      ~ tags_all         = {
          ~ "Name" = "my-vpc-private-us-east-1b" -> "vpc-us-east-1-prod-private-us-east-1b"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c9c6a3cb3c951e27"
      ~ tags             = {
          ~ "Name" = "my-vpc-private-us-east-1c" -> "vpc-us-east-1-prod-private-us-east-1c"
        }
      ~ tags_all         = {
          ~ "Name" = "my-vpc-private-us-east-1c" -> "vpc-us-east-1-prod-private-us-east-1c"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0d938e60a6926f078"
      ~ tags             = {
          ~ "Name" = "my-vpc-public" -> "vpc-us-east-1-prod-public"
        }
      ~ tags_all         = {
          ~ "Name" = "my-vpc-public" -> "vpc-us-east-1-prod-public"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0b9c035c555394d06" -> (known after apply)
      ~ subnet_id      = "subnet-0798cc1295be44403" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-00570a92f66c9a896" -> (known after apply)
      ~ subnet_id      = "subnet-050dd4e0563086065" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0840606a4481f31ff" -> (known after apply)
      ~ subnet_id      = "subnet-02ba936bec9acf961" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-01ece64fc0c3a6803" -> (known after apply)
      ~ subnet_id      = "subnet-03f3403075db47172" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0d2317fba1947cecf" -> (known after apply)
      ~ subnet_id      = "subnet-0bfc9cd2d88757e09" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-051b374aadd21d716" -> (known after apply)
      ~ subnet_id      = "subnet-03fe445f3a09caf91" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0798cc1295be44403" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.1.0/24" -> "10.0.0.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0798cc1295be44403" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "my-vpc-private-us-east-1a" -> "vpc-us-east-1-prod-private-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Name" = "my-vpc-private-us-east-1a" -> "vpc-us-east-1-prod-private-us-east-1a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-050dd4e0563086065" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.2.0/24" -> "10.0.1.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-050dd4e0563086065" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "my-vpc-private-us-east-1b" -> "vpc-us-east-1-prod-private-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Name" = "my-vpc-private-us-east-1b" -> "vpc-us-east-1-prod-private-us-east-1b"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-02ba936bec9acf961" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.3.0/24" -> "10.0.2.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-02ba936bec9acf961" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "my-vpc-private-us-east-1c" -> "vpc-us-east-1-prod-private-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "Name" = "my-vpc-private-us-east-1c" -> "vpc-us-east-1-prod-private-us-east-1c"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-03f3403075db47172" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.101.0/24" -> "10.0.3.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-03f3403075db47172" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "my-vpc-public-us-east-1a" -> "vpc-us-east-1-prod-public-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Name" = "my-vpc-public-us-east-1a" -> "vpc-us-east-1-prod-public-us-east-1a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-0bfc9cd2d88757e09" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.102.0/24" -> "10.0.4.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0bfc9cd2d88757e09" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "my-vpc-public-us-east-1b" -> "vpc-us-east-1-prod-public-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Name" = "my-vpc-public-us-east-1b" -> "vpc-us-east-1-prod-public-us-east-1b"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:004351562122:subnet/subnet-03fe445f3a09caf91" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.103.0/24" -> "10.0.5.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-03fe445f3a09caf91" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "004351562122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "my-vpc-public-us-east-1c" -> "vpc-us-east-1-prod-public-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "Name" = "my-vpc-public-us-east-1c" -> "vpc-us-east-1-prod-public-us-east-1c"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-02f71590ffce04a6d"
      ~ tags                                 = {
          ~ "Name" = "my-vpc" -> "vpc-us-east-1-prod"
        }
      ~ tags_all                             = {
          ~ "Name" = "my-vpc" -> "vpc-us-east-1-prod"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 15 to add, 12 to change, 15 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*